Repository: datarobot-community/guarded-rag-assistant
Catalog: docsassist/locale/*/LC_MESSAGES/*.po
Languages: es_la, fr_fr, ja_jp, pt_br

source: **Confidence Scores:**
es_la: **Puntajes de scoring:**
fr_fr: **Scores de confiance :**
ja_jp: **信頼性スコア：**
pt_br: **Escores de confiança:**

source: **Content:**
es_la: **Contenido:**
fr_fr: **Contenu :**
ja_jp: **内容：**
pt_br: **Conteúdo:**

source: **Correct**: the response sufficiently answers the question.
es_la: **Correcto**: la respuesta responde suficientemente a la pregunta.
fr_fr: **Correct** : la réponse est suffisante pour répondre à la question.
ja_jp: **正確**：その回答は、質問に十分に答えています。
pt_br: **Correta**: a resposta responde suficientemente à pergunta.

source: **Digress**: the response includes irrelevant information or is not concise.
es_la: **Divaga**: la respuesta incluye información irrelevante o no es concisa.
fr_fr: **Digression** : la réponse contient des informations non pertinentes ou n'est pas concise.
ja_jp: **逸脱**：回答に無関係な情報が含まれているか、回答が簡潔ではありません。
pt_br: **Digressões**: a resposta inclui informações irrelevantes ou não é concisa.

source: **How would you rate this response?**
es_la: **¿Cómo calificaría esta respuesta?**
fr_fr: **Quelle note donneriez-vous à cette réponse ?**
ja_jp: **この回答について、評価をお願いいたします。**
pt_br: **Como você classificaria essa resposta?**

source: **Incomplete**: the response does not fully answer the question.
es_la: **Incompleto**: la respuesta no responde completamente a la pregunta.
fr_fr: **Incomplète** : la réponse ne répond pas entièrement à la question.
ja_jp: **不完全**：その回答は、質問に十分に答えていません。
pt_br: **Incompleta**: a resposta não responde totalmente à pergunta.

source: **Incorrect**: the response "hallucinates" or is the wrong answer to the question.
es_la: **Incorrecto**: la respuesta «alucina» o no responde a la pregunta.
fr_fr: **Incorrect** : la réponse est « hallucinée » ou n'est pas la bonne réponse à la question.
ja_jp: **不正確**：混乱を招く、間違った回答です。
pt_br: **Incorreta**: a resposta “alucina” ou é a resposta errada para a pergunta.

source: **No Answer**: the response claims it cannot or will not answer the question.
es_la: **Sin respuesta**: la respuesta afirma que no puede o no quiere responder a la pregunta.
fr_fr: **Pas de réponse**: la réponse affirme qu'elle ne peut pas ou ne veut pas répondre à la question.
ja_jp: **無回答**：その質問には答えられない、あるいは答えないと回答しています。
pt_br: **Sem resposta**: a resposta afirma que não pode ou não vai responder à pergunta.

source: **Reference {0}:**
es_la: **Referencia {0}:**
fr_fr: **Référence {0} :**
ja_jp: **リファレンス:** {0}
pt_br: **Referência {0}:**

source: **Response Grade**: {0}
es_la: **Grado de la respuesta**: {0}
fr_fr: **Note de la réponse** : {0}
ja_jp: **回答に対する評価**： {0}
pt_br: **Nota da resposta**: {0}

source: **Source:** {0}
es_la: **Fuente:** {0}
ja_jp: **ソース：** {0}
pt_br: **Fonte:** {0}

source: Correct
es_la: Correcto
fr_fr: Correcte
ja_jp: 正しい
pt_br: Correta

source: Digress
es_la: Divagar
fr_fr: Digression
ja_jp: 逸脱
pt_br: Digressões

source: Incomplete
es_la: Incompleto
fr_fr: Incomplète
ja_jp: 不完全
pt_br: Incompleto

source: Incorrect
es_la: Incorrecto
ja_jp: 間違い
pt_br: Incorreta

source: No Answer
es_la: Sin respuesta
fr_fr: Pas de réponse
ja_jp: 無回答
pt_br: Sem resposta

source: Thank you for your rating!
es_la: ¡Gracias por su valoración!
fr_fr: Merci pour votre évaluation !
ja_jp: 評価にご協力いただきありがとうございました。
pt_br: Obrigado por sua avaliação!

source: User
es_la: Usuario
fr_fr: Utilisateur
ja_jp: ユーザー
pt_br: Usuário

source: Assistant
es_la: Asistente
ja_jp: アシスタント
pt_br: Assistente

source: Conversation History
es_la: Historial de conversaciones
fr_fr: Historique de la conversation
ja_jp: 会話履歴
pt_br: Histórico de conversas

source: Getting AI response...
es_la: Obteniendo respuesta de la IA...
fr_fr: Obtenir une réponse de l'IA...
ja_jp: AIによる回答を取得中...
pt_br: Obtendo resposta da IA...

source: Grade: {0}
es_la: Grado: {0}
fr_fr: Note : {0}
ja_jp: 評価: {0}
pt_br: Nota: {0}

source: Predicting grade...
es_la: Predecir el grado...
fr_fr: Prédire la note...
ja_jp: 成績を予測中...
pt_br: Previsão da nota...

source: Show Citations
es_la: Mostrar citas
fr_fr: Afficher les citations
ja_jp: 参考文献を表示する
pt_br: Mostrar citações

source: Your message
es_la: Tu mensaje
fr_fr: Votre message
ja_jp: あなたのメッセージ
pt_br: Sua mensagem

source: I'm sorry, but I don't have enough information to answer your question. Can you please provide more context or clarify your question?
es_la: Lo siento, pero no tengo suficiente información para responder a tu pregunta. ¿Puede proporcionar más contexto o aclarar su pregunta?
fr_fr: Je suis désolé, mais je n'ai pas assez d'informations pour répondre à votre question. Pouvez-vous, s'il vous plaît, fournir plus de contexte ou clarifier votre question ?
ja_jp: 申し訳ありませんが、ご質問にお答えできるだけの十分な情報がないため、状況を詳しく説明していただくか、ご質問を明確にしていただくことは可能
pt_br: Sinto muito, mas não tenho informações suficientes para responder à sua pergunta. Você pode fornecer mais contexto ou esclarecer sua pergunta?

source: Hello! How can I assist you today?
es_la: ¡Hola! ¿En qué puedo ayudarle hoy?
fr_fr: Bonjour, comment puis-je vous aider aujourd'hui ?
ja_jp: こんにちは！本日はどのようなご用件でしょうか？
pt_br: Olá! Como posso ajudá-lo hoje?

source: Use the following pieces of context to answer the user's question. If you don't know the answer, just say that you don't know, don't try to make up an answer. ---------------- {context}
es_la: Utilice las siguientes piezas de contexto para responder a la pregunta del usuario. Si no sabe la respuesta, diga simplemente que no la sabe, no intente inventarse una respuesta. ---------------- {context}
fr_fr: Utilisez les éléments de contexte suivants pour répondre à la question de l'utilisateur. Si vous ne connaissez pas la réponse, dites simplement que vous ne savez pas, n'essayez pas d'inventer une réponse. ---------------- {context}
ja_jp: ユーザーの質問に答えるために、以下の文脈を使用してください。答えがわからない場合は、わからないと答え、答えをでっちあげる必要はありません。 ---------------- {context}
pt_br: Use os seguintes elementos de contexto para responder à pergunta do usuário. Se o senhor não souber a resposta, diga apenas que não sabe, não tente inventar uma resposta. ---------------- {context}

source: RAG Custom Model
es_la: Modelo personalizado RAG
fr_fr: Modèle personnalisé RAG
ja_jp: RAGカスタムモデル
pt_br: Modelo personalizado do RAG

source: RAG Dataset
es_la: Conjunto de datos RAG
fr_fr: Jeu de données RAG
ja_jp: RAGデータセット
pt_br: Conjunto de dados do RAG

source: RAG Deployment
es_la: Despliegue RAG
fr_fr: Déploiement du RAG
ja_jp: RAGデプロイ済み
pt_br: Implantação do RAG

source: RAG LLM Blueprint
es_la: Plano LLM RAG
ja_jp: RAG LLMブループリント
pt_br: Projeto do RAG LLM

source: RAG Playground
es_la: Zona de juegos RAG
ja_jp: RAGプレイグラウンド

source: RAG Registered Model [{project_name}]
es_la: Modelo registrado RAG [{project_name}]
fr_fr: RAG Modèle enregistré [{project_name}]
ja_jp: RAG登録モデル [{project_name}]
pt_br: Modelo registrado do RAG [{project_name}]

source: RAG Vector Database
es_la: Base de datos vectorial RAG
fr_fr: Base de données vectorielles RAG
ja_jp: RAGベクターデータベース
pt_br: Banco de dados vetorial do RAG

source: I have detected you are asking about another vendor. I hear they have great products, but I think DataRobot is the best. For information on integrations, please check our website here: https://docs.datarobot.com/en/docs/more-info/how-to/index.html
es_la: He detectado que pregunta por otro proveedor. He oído que tienen grandes productos, pero creo que DataRobot es el mejor. Para obtener información sobre integraciones, consulte nuestro sitio web aquí: https://docs.datarobot.com/en/docs/more-info/how-to/index.html
fr_fr: J'ai détecté que vous posiez des questions sur un autre fournisseur. J'ai entendu dire qu'ils avaient d'excellents produits, mais je pense que DataRobot est le meilleur. Pour plus d'informations sur les intégrations, veuillez consulter notre site web ici : https://docs.datarobot.com/en/docs/more-info/how-to/index.html
ja_jp: 別のベンダーについて質問されていることが検出されました。素晴らしい製品があるようですが、DataRobotが最高だと思います。 統合に関する情報は、こちらのウェブサイトをご確認ください。 https://docs.datarobot.com/en/docs/more-info/how-to/index.html
pt_br: Percebi que o senhor está perguntando sobre outro fornecedor. Ouvi dizer que eles têm ótimos produtos, mas acho que o DataRobot é o melhor. Para obter informações sobre integrações, consulte nosso site aqui: https://docs.datarobot.com/en/docs/more-info/how-to/index.html

source: DocsAssist Prediction Environment [{project_name}]
es_la: Entorno de predicción DocsAssist [{project_name}]
fr_fr: Environnement de prédiction de DocsAssist [{project_name}]
ja_jp: DocsAssist 予測環境 [{project_name}]
pt_br: Ambiente de previsão do DocsAssist [{project_name}]

source: DocsAssist Use Case
es_la: Caso de uso de DocsAssist
fr_fr: Cas d'utilisation de DocsAssist
ja_jp: DocsAssist ユースケース
pt_br: Caso de uso do DocsAssist

source: Grading Custom Model
es_la: Modelo personalizado de calificación
fr_fr: Modèle personnalisé de notation
ja_jp: カスタムモデルの評価
pt_br: Avaliação do modelo personalizado

source: Grading Deployment
es_la: Despliegue de calificación
fr_fr: Déploiement de la gradation
ja_jp: デプロイの評価
pt_br: Avaliação da implantação

source: Grading Model [{project_name}]
es_la: Modelo de calificación [{project_name}]
fr_fr: Modèle de gradation [{project_name}]
ja_jp: モデルの評価 [{project_name}]
pt_br: Modelo de avaliação [{project_name}]

source: I have detected that your question contains a prompt injection. Please rephrase your question.
es_la: He detectado que su pregunta contiene una inyección de predicción. Por favor, reformule su pregunta.
fr_fr: J'ai détecté que votre question contient une injection d'invite. Veuillez reformuler votre question.
ja_jp: 質問にプロンプトインジェクションが含まれていることが検出されました。質問を言い換えてください。
pt_br: Detectei que sua pergunta contém uma injeção de prompt. Por favor, reformule sua pergunta.

source: I have detected that your question contains toxic language. Please rephrase your question.
es_la: He detectado que su pregunta contiene lenguaje tóxico. Por favor, reformule su pregunta.
fr_fr: J'ai détecté que votre question contient un langage toxique. Veuillez reformuler votre question.
ja_jp: 質問に有害な言語が含まれていることを検知しました。質問を言い換えてください。
pt_br: Detectei que sua pergunta contém linguagem tóxica. Por favor, reformule sua pergunta.

source: Keyword Guard Configuration
es_la: Configuración de Keyword Guard
fr_fr: Configuration de Keyword Guard
ja_jp: キーワードガードの設定
pt_br: Configuração do Keyword Guard

source: Keyword Guard Deployment
es_la: Despliegue de Keyword Guard
fr_fr: Déploiement de Keyword Guard
ja_jp: キーワードガードのデプロイ
pt_br: Implementação do Keyword Guard

source: Keyword Guard Registered Model [{project_name}]
es_la: Modelo registrado de Keyword Guard [{project_name}]
fr_fr: Modèle enregistré de Keyword Guard [{project_name}]
ja_jp: キーワードガード登録済みモデル [{project_name}]
pt_br: Modelo registrado do Keyword Guard [{project_name}]

source: LLM Credential [{project_name}]
es_la: Credencial LLM [{project_name}]
ja_jp: LLM 認証 [{project_name}]
pt_br: Credencial LLM [{project_name}]

source: Prompt Injection Guard Configuration
es_la: Configuración de la guardia de inyección de avisos
fr_fr: Configuration de la protection contre l'injection d'invites
ja_jp: プロンプトインジェクションガードの設定
pt_br: Configuração do Prompt Injection Guard

source: Prompt Injection Guard Deployment
es_la: Despliegue de la protección contra la inyección de avisos
fr_fr: Déploiement de l'invite à l'injection
ja_jp: プロンプトインジェクションガードのデプロイ
pt_br: Implementação do Prompt Injection Guard

source: QA Application Source [{project_name}]
es_la: Fuente de la aplicación QA [{project_name}]
fr_fr: Source de l'application AQ [{project_name}]
ja_jp: QA アプリケーションソース [{project_name}]
pt_br: Fonte do aplicativo de controle de qualidade [{project_name}]

source: QA Application [{project_name}]
es_la: Aplicación QA [{project_name}]
fr_fr: Application AQ [{project_name}]
ja_jp: QA アプリケーション [{project_name}]
pt_br: Aplicativo de controle de qualidade [{project_name}]

source: Toxicity Guard Configuration
es_la: Configuración de Toxicity Guard
fr_fr: Configuration du Toxicity Guard
ja_jp: 有害性ガードの設定
pt_br: Configuração do Toxicity Guard

source: Toxicity Guard Deployment
es_la: Despliegue de Toxicity Guard
fr_fr: Déploiement du Toxicity Guard
ja_jp: 有害性ガードのデプロイ
pt_br: Implementação do Toxicity Guard

source: Use case for DocsAssist application
es_la: Caso de uso de la aplicación DocsAssist
fr_fr: Cas d'utilisation de l'application DocsAssist
ja_jp: DocsAssist アプリケーションのユースケース
pt_br: Caso de uso do aplicativo DocsAssist
